artillery-estocastico/test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalCount: 1
  processor: "./processor.js"

scenarios:
  - name: "Trading Orders Poisson"
    flow:
      - function: "initPoisson"
      - loop:
          - function: "configurarOleada"
          - post:
              url: "{{ endpoint }}"
              json: "{{ payload }}"